
--==========================================================================================
--1. Написати збережену процедуру, яка показує кількість взятих книг по кожній з груп і по кожній з кафедр

exec Task_One;

--==========================================================================================
--2. Написати збережену процедуру, яка показує список книг, і яка відповідає набору критеріїв.
--   Критерії: ім'я автора, прізвище автора, тематика, категорія. Крім того список повинен бути 
--   відсортований по номеру поля, вказаному в 5-му параметрі, в напрямку, вказаному в 6-му параметрі (sp_executesql)


exec Task_Two @author_fname = 'Алекс';
exec Task_Two @author_lname = 'оро';
exec Task_Two @theme_ = 'дизайн';
exec Task_Two @category_ = 'basic';
exec Task_Two @column = 5;
exec Task_Two @sort = 'desc';
exec Task_Two 'оро', 'мир', 'мм', 'sic';

--==========================================================================================
-- 3. Написати збережену процедуру, яка показує список бібліотекарів, і кількість виданих кожним з них книг

exec Task_Three;

--==========================================================================================
-- 4. Створити збережену процедуру, яка покаже ім'я та прізвище студента, який взяв найбільшу кількість книг

exec Task_Four;

--==========================================================================================
-- 5. Створити збережену процедуру, яка поверне загальну кількість взятих з бібліотеки книг і викладачами і студентами

declare @Count_books int;
exec @Count_books = Task_Five;
print @Count_books;

--==========================================================================================

 